Tekla.Structures.DirectManipulation.Model.CreationCommands.ViewTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.ViewTypeProvider provides creation commands for different categories of view.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ViewTypeProvider.DrawingView
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating a drawing view.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ViewTypeProvider.ModelView
Gets the Tekla.BIM.DirectManipulation.Features.CreationCommandParameter for creating a model view.